In [1]:
import pandas as pd

In [2]:
import pymysql
pymysql.install_as_MySQLdb()

In [3]:
from sqlalchemy import create_engine

In [4]:
from sqlalchemy_utils import create_database, database_exists


connection = "mysql+pymysql://root:root@localhost/books"
engine = create_engine(connection)

![png](book_erd.png)

# CREATE DATABASE

In [5]:
create_database(connection)

# CREATE TABLES

In [7]:
# CSVs
user = pd.read_csv('users.csv')
author = pd.read_csv('authors.csv')
favorite = pd.read_csv('favorites.csv')
book = pd.read_csv('books.csv')

In [8]:
# Making tables using CSVs
user.to_sql('user', engine, if_exists = 'replace')
author.to_sql('author', engine, if_exists = 'replace')
favorite.to_sql('favorite', engine, if_exists = 'replace')
book.to_sql('book', engine, if_exists = 'replace')

6

In [9]:
q = """SELECT * FROM user;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
q = """SELECT * FROM author;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [11]:
q = """SELECT * FROM favorite;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [12]:
q = """SELECT * FROM book;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

# TEST

In [27]:
q = """SELECT b.title, f.user_id
FROM book AS b
JOIN favorite AS f
ON b.id = f.book_id
WHERE f.user_id = 
    (SELECT user.id FROM user
    WHERE (user.last_name = "Doe" AND user.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1